#include<stdio.h>;
#include<locale.h>;

void main()
{
	setlocale(LC_ALL, "Rus");
	int h, w, d;
	float m1, m2, m3, m4, m5;
	printf("Введите значение высоты, ширины  и грубины: ");
	scanf_s("%i %i %i", &h, &w, &d);
	if ((h >= 180 && h <= 220) && (w >= 80 && w <= 120) && (d >= 50 && d <= 90))
	{
		m1 = ((h * w * 0.05) / 1000000) * 800;
		m2 = (2 * (h * d * 0.15) / 1000000) * 750;
		m3 = (2 * (d * w * 0.15) / 1000000) * 750;
		m4 = (2 * (h * w) / 1000000) * 650;
		m5 = ((h / 40) * (w * d * 0.15) / 1000000) * 750;
		printf("%.2f", m1 + m2 + m3 + m4 + m5);
	}
	else
		printf("некоректные данные");

}